# Str2Angle

## Description
Convert a string representation of an angle value to a real number in degrees.

```pascal
FUNCTION Str2Angle(str : STRING): REAL;
```

```python
def vs.Str2Angle(str):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|str|STRING|The string representation of the angle value.|

## Version
Availability: from Vectorworks 2014

## Category
* Strings